﻿﻿//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	CPU.uni
//
// Description:	CPU unicode description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//
// CPU Configuration
//
#string STR_CPU_FORM                    #language eng "CPU Configuration"
#string STR_CPU_FORM_HELP               #language eng "CPU Configuration Parameters"

#string STR_CPU_SKT0_FORM               #language eng "Socket 0 CPU Information"
#string STR_CPU_SKT1_FORM               #language eng "Socket 1 CPU Information"
#string STR_CPU_SKT2_FORM               #language eng "Socket 2 CPU Information"
#string STR_CPU_SKT3_FORM               #language eng "Socket 3 CPU Information"
#string STR_CPU_SKT_FORM_HELP           #language eng "Socket specific CPU Information"

#string STR_CPU_SKT_NOT_PRESENT_HELP    #language eng "CPU not present"
#string STR_CPU_SKT_NOT_PRESENT_VALUE   #language eng "Not Present"
#string STR_CPU_SKT0_NOT_PRESENT_STRING #language eng "Socket 0"
#string STR_CPU_SKT1_NOT_PRESENT_STRING #language eng "Socket 1"
#string STR_CPU_SKT2_NOT_PRESENT_STRING #language eng "Socket 2"
#string STR_CPU_SKT3_NOT_PRESENT_STRING #language eng "Socket 3"

#string STR_CPU_MISMATCH_STRING         #language eng "Mismatch CPU"
#string STR_CPU_MISMATCH_VALUE          #language eng "Unsupported installed CPU combination."

#string STR_PROCESSOR_VERSION_STRING    #language eng "CPU Type"
#string STR_CPU_SKT0_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT1_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT2_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT3_VERSION_VALUE      #language eng ""

#string STR_CPU_SKT_MAXSPEED_STRING     #language eng "Max CPU Speed"
#string STR_CPU_SKT_MAXSPEED_HELP       #language eng "Displays the Max CPU Speed"
#string STR_CPU_SKT0_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT1_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT2_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT3_MAXSPEED_VALUE     #language eng ""

#string STR_CPU_SKT_MINSPEED_STRING     #language eng "Min CPU Speed"
#string STR_CPU_SKT_MINSPEED_HELP       #language eng "Displays the Max CPU Speed"
#string STR_CPU_SKT0_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT1_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT2_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT3_MINSPEED_VALUE     #language eng ""

#string STR_PROCESSOR_SPEED_STRING      #language eng "CPU Speed"
#string STR_PROCESSOR_SPEED_VALUE       #language eng ""
#string STR_PROCESSOR_SPEED_HELP        #language eng "Displays the CPU Speed"

#string STR_CPU_SKT_L1_DATA_CACHE_STRING    #language eng "L1 Data Cache"
#string STR_CPU_SKT_L1_DATA_CACHE_HELP      #language eng "L1 Data Cache Size"
#string STR_CPU_SKT0_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT1_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT2_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT3_L1_DATA_CACHE_VALUE    #language eng "Not Present"

#string STR_CPU_SKT_L1_CODE_CACHE_STRING    #language eng "L1 Code Cache"
#string STR_CPU_SKT_L1_CODE_CACHE_HELP      #language eng "L1 Code Cache Size"
#string STR_CPU_SKT0_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT1_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT2_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT3_L1_CODE_CACHE_VALUE    #language eng "Not Present"

#string STR_CPU_SKT_L2_CACHE_STRING        #language eng "L2 Cache"
#string STR_CPU_SKT_L2_CACHE_HELP          #language eng "L2 Cache Size"
#string STR_CPU_SKT0_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT1_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT2_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT3_L2_CACHE_VALUE        #language eng "Not Present"

#string STR_CPU_SKT_L3_CACHE_STRING        #language eng "L3 Cache"
#string STR_CPU_SKT_L3_CACHE_HELP          #language eng "L3 Cache Size"
#string STR_CPU_SKT0_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT1_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT2_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT3_L3_CACHE_VALUE        #language eng "Not Present"

#string STR_CPU_SKT_NUMCORE_STRING      #language eng "Processor Cores"
#string STR_CPU_SKT_NUMCORE_HELP        #language eng "Displays number of cores."
#string STR_CPU_SKT0_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT1_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT2_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT3_NUMCORE_VALUE      #language eng "0"

#string STR_CPU_SKT_HT_STRING           #language eng "Intel HT Technology"
#string STR_CPU_SKT_HT_HELP             #language eng "When Hyper-threading is enabled, 2 logical CPUS per core is present."
#string STR_CPU_SKT0_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT1_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT2_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT3_HT_VALUE           #language eng "Not Supported"

#string STR_CPU_SKT_VTX_STRING          #language eng "Intel VT-x Technology"
#string STR_CPU_SKT_VTX_HELP            #language eng "CPU VMX hardware support for virtual machines."
#string STR_CPU_SKT0_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT1_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT2_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT3_VTX_VALUE          #language eng "Not Supported"

#string STR_CPU_SKT_SMX_STRING          #language eng "Intel SMX Technology"
#string STR_CPU_SKT_SMX_HELP            #language eng "Secure Mode extensions support."
#string STR_CPU_SKT0_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT1_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT2_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT3_SMX_VALUE          #language eng "Not Supported"

#string STR_CPU_EMT64_HELP              #language eng "Displays if 64-bit supported"
#string STR_CPU_EMT64_STRING            #language eng "64-bit"
#string STR_CPU_EMT64_VALUE             #language eng "Supported"

// Do not translate the following!  The name is trademarked.
#string STR_PROCESSOR_HT_MODE           #language eng "Hyper Threading  Technology"
#string STR_PROCESSOR_HT_MODE_HELP      #language eng "Select Disabled if your operating system is Windows 2000"

#string STR_CPU_SKT_MICROCODE_STRING    #language eng "Microcode Patch"
#string STR_CPU_SKT_MICROCODE_HELP      #language eng "CPU Microcode Patch Revision"
#string STR_CPU_SKT0_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT1_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT2_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT3_MICROCODE_VALUE    #language eng "Not loaded"

#string STR_CPU_SKT_CPUID_STRING        #language eng "CPU Signature"
#string STR_CPU_SKT_CPUID_HELP          #language eng "Displays CPU Signature"
#string STR_CPU_SKT0_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT1_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT2_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT3_CPUID_VALUE        #language eng ""

#string STR_BSP_SELECT_PROMPT           #language eng "BSP Select"
#string STR_BSP_SELECT_PROMPT_HELP      #language eng "User selects which core is BSP."

#string STR_CPU_MAX_RATIO               #language eng "Max Freq Ratio"
#string STR_CPU_MAX_RATIO_HELP          #language eng ""

#string STR_CPU_SET_BOOT_RATIO          #language eng "Set Boot Freq Ratio"
#string STR_CPU_SET_BOOT_RATIO_HELP     #language eng ""

#string STR_CPU_FACTORY_TDC_STRING      #language eng "Factory TDC Limit"
#string STR_CPU_FACTORY_TDC_HELP        #language eng "Factory Turbo Mode Current Limit in Amps."
#string STR_CPU_FACTORY_TDC_VALUE       #language eng ""
#string STR_CPU_TDC                     #language eng "TDC Limit"
#string STR_CPU_TDC_HELP                #language eng "Turbo-XE Mode Processor TDC Limit in Amps. 0 means using the factory-configured value."

#string STR_CPU_FACTORY_TDP_STRING      #language eng "Factory TDP Limit"
#string STR_CPU_FACTORY_TDP_HELP        #language eng "Factory Turbo Mode Power Limit in Watts."
#string STR_CPU_FACTORY_TDP_VALUE       #language eng ""
#string STR_CPU_TDP                     #language eng "TDP Limit"
#string STR_CPU_TDP_HELP                #language eng "Turbo-XE Mode Processor TDP Limit in Watts. 0 means using the factory-configured value."

#string STR_CPU_FACTY_LONG_DUR_PWR_HELP     #language eng "Factory turbo Mode Power limit in Watts."
#string STR_CPU_FACTY_LONG_DUR_PWR_STRING   #language eng "Factory long duration power limit"
#string STR_CPU_FACTY_LONG_DUR_PWR_VALUE    #language eng ""
#string STR_CPU_LONG_DUR_PWR                #language eng "Long duration power limit"
#string STR_CPU_LONG_DUR_PWR_HELP           #language eng "Long duration power limit in Watts."

#string STR_CPU_FACTY_LONG_DUR_TIME_HELP    #language eng "Time window which the long duration power is maintained."
#string STR_CPU_FACTY_LONG_DUR_TIME_STRING  #language eng "Factory long duration maintained"
#string STR_CPU_FACTY_LONG_DUR_TIME_VALUE   #language eng ""
#string STR_CPU_LONG_DUR_TIME               #language eng "Long duration maintained"
#string STR_CPU_LONG_DUR_TIME_HELP          #language eng "Time window which the long duration power is maintained."

#string STR_CPU_FACTY_SHRT_DUR_PWR_HELP     #language eng "Factory turbo mode power limit in Watts."
#string STR_CPU_FACTY_SHRT_DUR_PWR_STRING   #language eng "Recommended short duration power limit"
#string STR_CPU_FACTY_SHRT_DUR_PWR_VALUE    #language eng "1.25 * Long Duration"
#string STR_CPU_SHRT_DUR_PWR                #language eng "Short duration power limit"
#string STR_CPU_SHRT_DUR_PWR_HELP           #language eng "Short duration power limit in Watts"

#string STR_CPU_BASE_FREQ_STRING        #language eng "Base Frequency"
#string STR_CPU_BASE_FREQ_HELP          #language eng "Base Frequency"
#string STR_CPU_CPU_BASE_FREQ_VALUE     #language eng "133 MHz"
#string STR_XE_CORE_RATIO_LIMIT         #language eng "XE Core Ratio Limit"
#string STR_XE_CORE_RATIO_LIMIT_HELP    #language eng "XE Core Ratio Limit. CPU Frequency is Base Frequency * Ratio. 0 means using the factory-configured value."

#string STR_CPU_1_CORE_RATIO_LIMIT      #language eng "1-Core Ratio Limit"
#string STR_CPU_1_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 1 core active. 0 means using the factory-configured value."

#string STR_CPU_2_CORE_RATIO_LIMIT      #language eng "2-Core Ratio Limit"
#string STR_CPU_2_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 2 cores active. 0 means using the factory-configured value."

#string STR_CPU_3_CORE_RATIO_LIMIT      #language eng "3-Core Ratio Limit"
#string STR_CPU_3_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 3 cores active.  0 means using the factory-configured value."

#string STR_CPU_4_CORE_RATIO_LIMIT      #language eng "4-Core Ratio Limit"
#string STR_CPU_4_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 4 cores active.  0 means using the factory-configured value."

#string STR_CPU_5_CORE_RATIO_LIMIT      #language eng "5-Core Ratio Limit"
#string STR_CPU_5_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 5 cores active.  0 means using the factory-configured value."

#string STR_CPU_6_CORE_RATIO_LIMIT      #language eng "6-Core Ratio Limit"
#string STR_CPU_6_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 6 cores active.  0 means using the factory-configured value."

#string STR_CPU_7_CORE_RATIO_LIMIT      #language eng "7-Core Ratio Limit"
#string STR_CPU_7_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 7 cores active.  0 means using the factory-configured value."

#string STR_CPU_8_CORE_RATIO_LIMIT      #language eng "8-Core Ratio Limit"
#string STR_CPU_8_CORE_RATIO_LIMIT_HELP #language eng "This limit is for 8 cores active.  0 means using the factory-configured value."

#string STR_CPU_FACTY_VID_HELP          #language eng "Factory VID for Max Turbo Ratio"
#string STR_CPU_FACTY_VID_STRING        #language eng "Factory VID for Max Turbo Ratio"
#string STR_CPU_FACTY_VID_VALUE         #language eng ""

#string STR_CPU_VID                     #language eng "VID Override for Max Turbo Ratio"
#string STR_CPU_VID_HELP                #language eng "VID Override for Max Turbo Ratio in 1/256 Volts"

#string STR_CPU_XD_BIT_PROMPT           #language eng "Execute Disable Bit"
#string STR_CPU_XD_BIT_PROMPT_HELP      #language eng "XD can prevent certain classes of malicious buffer overflow attacks when combined with a supporting OS (Windows Server 2003 SP1, Windows XP SP2, SuSE Linux 9.2, RedHat Enterprise 3 Update 3.)"

#string STR_CPU_HTD_PROMPT              #language eng "Hyper-threading"
#string STR_CPU_HTD_PROMPT_HELP         #language eng "Enabled for Windows XP and Linux (OS optimized for Hyper-Threading Technology) and Disabled for other OS (OS not optimized for Hyper-Threading Technology). When Disabled only one thread per enabled core is enabled." 

#string STR_CPU_1					    #language eng "1"
#string STR_CPU_2					    #language eng "2"
#string STR_CPU_3					    #language eng "3"
#string STR_CPU_4					    #language eng "4"
#string STR_CPU_5					    #language eng "5"
#string STR_CPU_6					    #language eng "6"
#string STR_CPU_7					    #language eng "7"
#string STR_CPU_8					    #language eng "8"
#string STR_CPU_9					    #language eng "9"
#string STR_CPU_ALL					    #language eng "All"

#string STR_CPU_ACTIVE_CORE_COUNT_PROMPT        #language eng "Active Processor Cores"
#string STR_CPU_ACTIVE_CORE_COUNT_PROMPT_HELP   #language eng "Number of cores to enable in each processor package." 
#string STR_CPU_EX_ACTIVE_CORE_COUNT_PROMPT_HELP #language eng "Each bit position represents a core to be enable in each procesor package."


#string STR_CPU_TURBO_MODE_PROMPT               #language eng "Turbo Mode"
#string STR_CPU_TURBO_MODE_PROMPT_HELP          #language eng "Turbo Mode." 

#string STR_CPU_LIMIT_CPUID_MAX_PROMPT		#language eng "Limit CPUID Maximum"
#string STR_CPU_LIMIT_CPUID_MAX_PROMPT_HELP	#language eng "Disabled for Windows XP"

#string STR_CPU_SRV_PREFETCH_PROMPT         #language eng "Server Class"
#string STR_CPU_SRV_PREFETCH_PROMPT_HELP    #language eng "Use Intel recommended prefetch settings."
#string STR_CPU_PREF_ENTERPRISE             #language eng "Enterprise"
#string STR_CPU_PREF_HPC                    #language eng "High Performance (HPC)"
#string STR_CPU_PREF_CUSTOM                 #language eng "Custom"

#string STR_PROC_HW_PREFETCH_PROMPT		    #language eng "Hardware Prefetcher"
#string STR_PROC_HW_PREFETCH_PROMPT_HELP	#language eng "Enable the Mid Level Cache (L2) streamer prefetcher."

#string STR_PROC_ADJ_CACHE_LINE_PROMPT		#language eng "Adjacent Cache Line Prefetch"
#string STR_PROC_ADJ_CACHE_LINE_PROMPT_HELP	#language eng "Enable the Mid Level Cache (L2) prefetching of adjacent cache lines."

#string STR_CPU_DCU_STREAMER_PREFETCH_PROMPT      #language eng "DCU Streamer Prefetcher"
#string STR_CPU_DCU_STREAMER_PREFETCH_PROMPT_HELP #language eng "Enable prefetch of next L1 Data line based upon multiple loads in same cache line."

#string STR_CPU_DCU_IP_PREFETCH_PROMPT      #language eng "DCU IP Prefetcher"
#string STR_CPU_DCU_IP_PREFETCH_PROMPT_HELP #language eng "Enable prefetch of next L1 line based upon sequential load history."


#string STR_CPU_DATA_REUSE_PROMPT           #language eng "Data Reuse Optimization"
#string STR_CPU_DATA_REUSE_PROMPT_HELP      #language eng "Data Reuse Performance Optimization"


#string STR_CPU_TM_PROMPT                   #language eng "TM support"
#string STR_CPU_TM_PROMPT_HELP              #language eng "Enable CPU thermal management"

#string STR_CPU_ENHANCED_DEBUG_PROMPT		#language eng "Enhanced Debug"
#string STR_CPU_ENHANCED_DEBUG_PROMPT_HELP	#language eng "Disabled for nomral system operation, Enabled for test environments."

#string STR_CPU_VT_PROMPT			#language eng "Intel Virtualization Technology"
#string STR_CPU_VT_PROMPT_HELP		#language eng "When enabled, a VMM can utilize the additional hardware capabilities provided by Vanderpool Technology"

#string STR_CPU_PM_PROMPT		#language eng "Power Technology"
#string STR_CPU_PM_PROMPT_HELP	#language eng "Enable the power management features."
#string STR_CPU_PM_DISABLED		#language eng "Disable"
#string STR_CPU_PM_ENABLED		#language eng "Energy Efficient"
#string STR_CPU_PM_CUSTOM		#language eng "Custom"


#string STR_CPU_ACPI_C2         #language eng "ACPI C-2"
#string STR_CPU_ACPI_C3         #language eng "ACPI C-3"

#string STR_CPU_EIST_PROMPT			#language eng "EIST"
#string STR_CPU_EIST_PROMPT_HELP	#language eng "Enable/Disable Intel SpeedStep"


#string STR_CPU_ENG_PERF_BIAS_PROMPT        #language eng "Performance/Watt"
#string STR_CPU_ENG_PERF_BIAS_PROMPT_HELP   #language eng "Optimized - Turbo Boost engages after higest performance state is sustained for more than 2 seconds. Traditional Intel Turbo Boost Technology is engaged immediately when possible."
#string STR_CPU_ENG_PERF_BIAS_TRADITIONAL   #language eng "Traditional"
#string STR_CPU_ENG_PERF_BIAS_OPTIMIZED     #language eng "Power Optimized"


#string STR_CPU_PACKAGE_CSTATE_REPORT       #language eng "Package C State limit"
#string STR_CPU_PACKAGE_CSTATE_REPORT_HELP  #language eng "Package C State limit"

#string STR_CPU_C0SUPPORT                   #language eng "C0"
#string STR_CPU_C1SUPPORT                   #language eng "C1"
#string STR_CPU_C2SUPPORT                   #language eng "C2"
#string STR_CPU_C3SUPPORT                   #language eng "C3"
#string STR_CPU_C6SUPPORT                   #language eng "C6"
#string STR_CPU_C7SUPPORT                   #language eng "C7"

#string STR_CPU_NOLIMIT                     #language eng "No Limit"
#string STR_CPU_NOLIMIT_HELP                #language eng "No Package C State limit"

#string STR_CPU_DEFAULT                     #language eng "Default"
#string STR_CPU_DEFAULT_HELP                #language eng "Use factory-configured value"

#string STR_CPU_C3_PROMPT		        #language eng "CPU C3 Report"
#string STR_CPU_C3_PROMPT_HELP		    #language eng "Enable/Disable CPU C3(ACPI C2) report to OS"

#string STR_CPU_C6_PROMPT               #language eng "CPU C6 report"
#string STR_CPU_C6_PROMPT_HELP          #language eng "Enable/Disable CPU C6(ACPI C3) report to OS"

#string STR_CPU_C7_PROMPT               #language eng "CPU C7 report"
#string STR_CPU_C7_PROMPT_HELP          #language eng "Enable/Disable CPU C7(ACPI C3) report to OS"

#string STR_CPU_CX_INTR_FILTER_PROMPT       #language eng "Interrupt Filtering"
#string STR_CPU_CX_INTR_FILTER_PROMPT_HELP  #language eng "When enabled, only the core that is the destination of an interrupt while in C3/C6 will be notified to transition to C0. When disabled, all cores be notified to transition to C0, regardless of destination."

#string STR_CPU_BSP_SELECT_PROMPT           #language eng "BSP Select"
#string STR_CPU_BSP_SELECT_PROMPT_HELP      #language eng "Select the BSP"
#string STR_CPU_BSP_SELECT_AUTO             #language eng "AUTO"
#string STR_CPU_BSP_SELECT_0                #language eng "CPU 0"
#string STR_CPU_BSP_SELECT_1                #language eng "CPU 1"

#string STR_CPU_PSD_COORD_TYPE_PROMPT       #language eng "P-STATE Coordination"
#string STR_CPU_PSD_COORD_TYPE_PROMPT_HELP  #language eng "Change P-STATE Coordination type"
#string STR_CPU_PSD_HW_ALL                  #language eng "HW_ALL"
#string STR_CPU_PSD_SW_ALL                  #language eng "SW_ALL"
#string STR_CPU_PSD_SW_ANY                  #language eng "SW_ANY"

#string STR_CPU_LOCAL_APIC_PROMPT           #language eng "Local APIC Mode"
#string STR_CPU_LOCAL_APIC_PROMPT_HELP      #language eng "Select Local APIC mode. If Auto, use x2APIC if required, otherwise, xAPIC mode. xAPIC will disable CPUs with APIC IDs greater than 254. Some OSes don't support x2APIC mode."

#string STR_CPU_AUTO                        #language eng "Auto"
#string STR_CPU_X2APIC                      #language eng "x2APIC"
#string STR_CPU_XAPIC                       #language eng "xAPIC"

#string STR_CPU_MPS_ORDER_PROMPT            #language eng "MP table order"
#string STR_CPU_MPS_ORDER_PROMPT_HELP       #language eng "Order of the CPU entries in the ACPI MADT or Legacy MP table. Legacy is only for Windows 2000 and earlier."
#string STR_CPU_MODERN                      #language eng "Modern"
#string STR_CPU_LEGACY                      #language eng "Legacy"

#string STR_CPU_ENABLED                     #language eng "Enabled"
#string STR_CPU_DISABLED                    #language eng "Disabled"

//#string <string name> #language eng ""

//---------------------------------------------------------------------------
//Cpu Thermal Configuration
//---------------------------------------------------------------------------
#string STR_CPU_THERMAL_CONFIG_FORM_TITLE    #language eng "CPU Thermal Configuration"
#string STR_CPU_THERMAL_CONFIG_FORM_HELP     #language eng "CPU Thermal Configuration options"
#string STR_CPU_THERMAL_CONFIGURATION        #language eng "Cpu Thermal Configuration"
#string STR_ENABLE_DTS_PROMPT                #language eng "DTS"
#string STR_ENABLE_DTS_HELP                  #language eng "Enabled/Disable Digital Thermal Sensor."

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
